tutorials/pureDEM/HFDIBDEMFoam/pouringSpheres/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ("bodysphere");

interpolationSchemes
{
  U cell;
}
surfaceThreshold    1e-4;
stepDEM     		0.01;
geometricD 		    (1 1 1);
recordSimulation 	true;
recordFirstTimeStep false;
nSolidsInDomain 	100; 

outputSetup
{
    basic 			true;
    iB  			true;
    DEM 			false;
    addModel 		false;
    parallelDEM 	false;
}
DEM
{
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.5;
            mu      0;
            adhN    0;
			eps	 	0.75;
        }
        
        wall
        {
            Y       1e8;
            nu      0.5;
            mu      0;
            adhN    0;
			eps	 	0.75;
        }	
    }
	LcCoeff 4.0;		
    collisionPatches
    {
				wall0
				{
					material wall;
					nVec (1.0 0.0 0.0);
					planePoint (0.015 0.00 0.0);
				}
				wall1
				{
					material wall;
					nVec (0.0 -1.0 0.0);
					planePoint (0.00 -0.05 0.0);
				}

				wall2
				{
					material wall;
					nVec (-1.0 0.0 0.0);
					planePoint (-0.015 0.0 0.0);
				}

				wall3
				{
					material wall;
					nVec (0.0 0.0 1.0);
					planePoint ( 0.0 0.0 0.015);
				}

				wall4
				{
					material wall;
					nVec (0.0 0.0 -1.0);
					planePoint (0.0 0.0 -0.015);
				}
    }
}

bodysphere
{
	fullyCoupledBody;
	rho        			rho [1 -3 0 0 0 0 0] 4000;
	material 			particle;
	updateTorque 		true;
	interfaceSpan 		1.0;
	startSynced 		false;
	timesToSetStatic 	150;
	bodyGeom 			sphere;
	sphere
	{
		radius 0.002;
		startPosition (0 0.035 0);
	}	
	bodyAddition
	{
		addModel onceScatter;
		onceScatterCoeffs
		{
			addMode fieldBased;
			fieldBasedCoeffs
			{
				fieldName lambda;
				fieldValue 0.1;
			}
			addDomain boundBox;
			boundBoxCoeffs
			{
				minBound (-0.015 -0.04 -0.015);
				maxBound (0.015 0.05 0.015);
			}
			
			scalingMode    noScaling;
			noScalingCoeffs{}
			
			rotationMode   randomRotation;
			randomRotationCoeffs{}
		}
	}	
}
// ************************************************************************* //